'use strict';

module.exports.DEFAULT_COUNT = 1;
module.exports.GENERATED_FILE_NAME = `mocks.json`;
module.exports.TITLES = [
  'Продам книги Стивена Кинга.',
  'Продам новую приставку Sony Playstation 5.',
  'Продам отличную подборку фильмов на VHS.',
  'Куплю антиквариат.',
  'Куплю породистого кота.',
  'Продам коллекцию журналов «Огонёк».',
  'Отдам в хорошие руки подшивку «Мурзилка».',
  'Продам советскую посуду. Почти не разбита.',
  'Куплю детские санки.',
];
module.exports.SENTENCES = [
  `Товар в отличном состоянии.`,
  `Пользовались бережно и только по большим праздникам.`,
  `Продаю с болью в сердце...`,
  `Бонусом отдам все аксессуары.`,
  `Даю недельную гарантию.`,
  `Если товар не понравится — верну всё до последней копейки.`,
  `Это настоящая находка для коллекционера!`,
  `Если найдёте дешевле — сброшу цену.`,
  `Таких предложений больше нет!`,
  `При покупке с меня бесплатная доставка в черте города.`,
  'Две страницы заляпаны свежим кофе.',
  'Кажется, что это хрупкая вещь.',
  'Мой дед не мог её сломать.',
  'Кому нужен этот новый телефон, если тут такое...',
  'Не пытайтесь торговаться. Цену вещам я знаю.',
];
module.exports.IMAGE_FILE_NAMES = [
  `tvovar_v_otlochnom_sostoyanii`,
  `peregno_and_good_conditions`,
  `sell_with_heart_hurt`,
  'buy_antique',
  'buy_cat_breed'
]
module.exports.CATEGORIES = [
  `Книги`,
  `Разное`,
  `Посуда`,
  `Игры`,
  `Животные`,
  `Журналы`,
];
module.exports.DEFAULT_COMMAND = `--help`;
module.exports.USER_ARGV_INDEX = 2;
module.exports.ExitCode = {
  error: 1,
  success: 0,
};
